; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link joint angle)

(:predicates
	(connected ?j - joint ?l - link) ;; considero solo il fatto che un link sia connesso ad un joint, ignoro la direzione.
	(angle-before ?a - angle ?a1 - angle)
	(angle-joint ?a - angle ?j - joint)
	(affected ?j - joint ?l - link ?j1 - joint) ;; nel momento in cui uso un link come child, per ruotare il joint ?j1, tutti i joint successivi cambiano angolo.
)

(:action increase_angle
:parameters (?link1 ?link2 - link ?joint - joint ?a1 ?a2 - angle)
:precondition (and 
	(connected ?joint ?link1)
	(connected ?joint  ?link2)
	(not (= ?link1 ?link2))
	(angle-joint ?a1 ?joint)
	(angle-before ?a1 ?a2)
	)
:effect 
    (and 
	    (not (angle-joint ?a1 ?joint)) 
	    (angle-joint ?a2 ?joint)
	    (forall (?js - joint ?a3 ?a4 - angle )
		    (when (and (affected ?js ?link1 ?joint) (not (= ?js ?joint)) (angle-joint ?a3 ?js) (angle-before ?a3 ?a4) )
		        (and
			        (not (angle-joint ?a3 ?js))
			        (angle-joint ?a4 ?js)
		        )
		    )
	    )
    )
)


(:action decrease_angle
:parameters (?link1 ?link2 - link ?joint - joint ?a1 ?a2 - angle)
:precondition (and 
	(connected ?joint ?link1)
	(connected ?joint  ?link2)
	(not (= ?link1 ?link2))
	(angle-joint ?a1 ?joint)
	(angle-before ?a2 ?a1)
	)
:effect 
    (and 
	    (not (angle-joint ?a1 ?joint)) 
	    (angle-joint ?a2 ?joint)
	    (forall (?js - joint ?a3 ?a4 - angle )
		    (when (and (affected ?js ?link1 ?joint) (not (= ?js ?joint)) (angle-joint ?a3 ?js) (angle-before ?a4 ?a3) )
		        (and
			        (not (angle-joint ?a3 ?js))
			        (angle-joint ?a4 ?js)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_8)
(:domain joint_bar)
(:objects
    link1 link2 link3 link4 - link
    joint1 joint2 joint3 joint4 - joint
    angle0 angle90 angle180 angle270 - angle)
(:init
    (angle-before angle0 angle90)
    (angle-before angle90 angle180)
    (angle-before angle180 angle270)
    (angle-before angle270 angle0)

    (affected joint1 link1 joint2)
    (affected joint1 link2 joint3)
    (affected joint1 link3 joint4)
    (affected joint2 link1 joint1)
    (affected joint2 link2 joint3)
    (affected joint2 link3 joint4)
    (affected joint3 link1 joint1)
    (affected joint3 link2 joint2)
    (affected joint3 link3 joint4)
    (affected joint4 link1 joint1)
    (affected joint4 link2 joint2)
    (affected joint4 link3 joint3)

    (connected joint1 link1)
    (connected joint2 link1)
    (connected joint2 link2)
    (connected joint3 link2)
    (connected joint3 link3)
    (connected joint4 link3)
    (connected joint4 link4)

    (angle-joint angle270 joint1)
    (angle-joint angle90 joint2)
    (angle-joint angle0 joint3)
    (angle-joint angle90 joint4)
)
(:goal
(and
    (angle-joint angle90 joint1)
    (angle-joint angle270 joint2)
    (angle-joint angle180 joint3)
    (angle-joint angle0 joint4)
    )
)
)

; plan
1. (increase_angle link1 link2 joint2 angle90 angle180)
   deleted: (angle-joint angle90 joint2) (angle-joint angle270 joint1)
   added: (angle-joint angle180 joint2) (angle-joint angle0 joint1)
   goals met: 0 of 4
2. (increase_angle link4 link3 joint4 angle90 angle180)
   deleted: (angle-joint angle90 joint4)
   added: (angle-joint angle180 joint4)
   goals met: 0 of 4
3. (increase_angle link3 link4 joint4 angle180 angle270)
   deleted: (angle-joint angle180 joint4) (angle-joint angle0 joint1) (angle-joint angle180 joint2) (angle-joint angle0 joint3)
   added: (angle-joint angle270 joint4) (angle-joint angle90 joint1) (angle-joint angle270 joint2) (angle-joint angle90 joint3)
   goals met: 2 of 4
4. (increase_angle link2 link3 joint3 angle90 angle180)
   deleted: (angle-joint angle90 joint3) (angle-joint angle90 joint1) (angle-joint angle270 joint2)
   added: (angle-joint angle180 joint3) (angle-joint angle180 joint1) (angle-joint angle0 joint2)
   goals met: 1 of 4
5. (increase_angle link4 link3 joint4 angle270 angle0)
   deleted: (angle-joint angle270 joint4)
   added: (angle-joint angle0 joint4)
   goals met: 2 of 4
6. (decrease_angle link1 link2 joint2 angle0 angle270)
   deleted: (angle-joint angle0 joint2) (angle-joint angle180 joint1)
   added: (angle-joint angle270 joint2) (angle-joint angle90 joint1)
   goals met: 4 of 4
